---
kind: method
id: M:Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor
source: html/0c5861b7-d68e-cd4d-4dd6-d21a2fd9f428.htm
---
# Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor Method

Creates a spherical light distribution object.

## Syntax (C#)
```csharp
public SphericalLightDistribution()
```